<!-- add-pr-comment:add-pr-comment -->

data.archive_file.func1: Reading...
data.archive_file.func1: Read complete after 0s [id=26e9ba93578c79b902b272b38b7e0a4dc2c252e9]
data.aws_acm_certificate.namabanana: Reading...
aws_cloudfront_function.index_document_function: Refreshing state... [id=index-document-function]
data.aws_cloudfront_cache_policy.managed_caching_disabled: Reading...
aws_cloudwatch_log_group.func1: Refreshing state... [id=/aws/lambda/send-mail-ses]
data.aws_cloudfront_origin_request_policy.managed_all_viewer_except_host_header: Reading...
aws_api_gateway_rest_api.send_mail_api: Refreshing state... [id=22fm1a0bc1]
data.aws_cloudfront_cache_policy.managed_caching_optimized: Reading...
data.aws_iam_role.func1_role: Reading...
aws_s3_bucket.send_mail_ses_src: Refreshing state... [id=send-mail-ses-src]
aws_s3_bucket.static_pages: Refreshing state... [id=note-app-static-pages]
data.aws_acm_certificate.namabanana: Read complete after 1s [id=arn:aws:acm:us-east-1:958933161565:certificate/a435f1f9-6cf8-410c-be31-3eb3ee4180a9]
data.aws_cloudfront_cache_policy.managed_caching_disabled: Read complete after 1s [id=4135ea2d-6df8-44a3-9df3-4b5a84be39ad]
data.aws_cloudfront_cache_policy.managed_caching_optimized: Read complete after 1s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
data.aws_cloudfront_origin_request_policy.managed_all_viewer_except_host_header: Read complete after 1s [id=b689b0a8-53d0-40ab-baf2-68738e2966ac]
data.aws_iam_role.func1_role: Read complete after 1s [id=LambdaSESMailRole]
aws_api_gateway_resource.send_mail_api_resource: Refreshing state... [id=25xmpf]
aws_api_gateway_method.send_mail_api_post: Refreshing state... [id=agm-22fm1a0bc1-25xmpf-POST]
aws_api_gateway_method_response.options_response: Refreshing state... [id=agmr-22fm1a0bc1-25xmpf-OPTIONS-200]
aws_api_gateway_integration_response.options_response: Refreshing state... [id=agir-22fm1a0bc1-25xmpf-OPTIONS-200]
aws_api_gateway_method.options_method: Refreshing state... [id=agm-22fm1a0bc1-25xmpf-OPTIONS]
aws_api_gateway_integration.options_integration: Refreshing state... [id=agi-22fm1a0bc1-25xmpf-OPTIONS]
aws_api_gateway_method_response.post_response: Refreshing state... [id=agmr-22fm1a0bc1-25xmpf-POST-200]
aws_cloudfront_origin_access_control.note_app_oac: Refreshing state... [id=EP34N1TT7FO74]
aws_s3_object.func1: Refreshing state... [id=send-mail-ses.zip]
aws_cloudfront_distribution.note_app_cfront: Refreshing state... [id=E35CO338AZ8MF7]
aws_lambda_function.func1: Refreshing state... [id=send-mail-ses]
aws_s3_bucket_policy.static_website: Refreshing state... [id=note-app-static-pages]
aws_lambda_permission.apigw: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.send_mail_api_post: Refreshing state... [id=agi-22fm1a0bc1-25xmpf-POST]
aws_api_gateway_deployment.send_mail_api: Refreshing state... [id=k8zg82]
aws_api_gateway_integration_response.post_response: Refreshing state... [id=agir-22fm1a0bc1-25xmpf-POST-200]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.policy_document will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "policy_document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::note-app-static-pages",
              + "arn:aws:s3:::note-app-static-pages/*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::958933161565:distribution/E35CO338AZ8MF7",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_cloudfront_distribution.note_app_cfront will be updated in-place
  ~ resource "aws_cloudfront_distribution" "note_app_cfront" {
        id                              = "E35CO338AZ8MF7"
        tags                            = {}
        # (22 unchanged attributes hidden)

      ~ default_cache_behavior {
          + cache_policy_id            = "658327ea-f89d-4fab-a63d-7e88639e58f6"
            # (15 unchanged attributes hidden)

          - forwarded_values {
              - headers                 = [] -> null
              - query_string            = false -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }

            # (2 unchanged blocks hidden)
        }

      ~ ordered_cache_behavior {
          + cache_policy_id            = "4135ea2d-6df8-44a3-9df3-4b5a84be39ad"
          + origin_request_policy_id   = "b689b0a8-53d0-40ab-baf2-68738e2966ac"
          ~ path_pattern               = "/api/send" -> "/send"
            # (14 unchanged attributes hidden)

          - forwarded_values {
              - headers                 = [
                  - "Authorization",
                ] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "all" -> null
                  - whitelisted_names = [] -> null
                }
            }

            # (1 unchanged block hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # aws_s3_bucket_policy.static_website will be updated in-place
  ~ resource "aws_s3_bucket_policy" "static_website" {
        id     = "note-app-static-pages"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "aws:SourceArn" = "arn:aws:cloudfront::958933161565:distribution/E35CO338AZ8MF7"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::note-app-static-pages/*",
                          - "arn:aws:s3:::note-app-static-pages",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

Warning: Quoted references are deprecated

  on apigateway.tf line 43, in resource "aws_api_gateway_deployment" "send_mail_api":
  43:     "aws_api_gateway_integration.send_mail_api_post",

In this context, references are expected literally rather than in quotes.
Terraform 0.11 and earlier required quotes, but quoted references are now
deprecated and will be removed in a future version of Terraform. Remove the
quotes surrounding this reference to silence this warning.

Warning: Argument is deprecated

  with aws_api_gateway_deployment.send_mail_api,
  on apigateway.tf line 47, in resource "aws_api_gateway_deployment" "send_mail_api":
  47:   stage_name  = "v1"

stage_name is deprecated. Use the aws_api_gateway_stage resource instead.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
